{
  "main": {
    "name":"Alex Serret",
    "occupation":"Developer and Designer",
    "description":"and my passion is merging these two disciplines into visually appealing and technically impressive projects. I am currently looking to grow in a top-tier engineering environment",
    "image":"profilepic.jpg",
    "bio":"Since early childhood I've been a gamer. My family likes to joke that I was born with a Nintendo controller in my hand. Unfortunately my work in game development hasn't extended beyond school, but fortunately I have maintained a passion for mixed media. The integration of code and art has long been a primary interest of mine with a high degree of comfort in either world. Currently I am looking to learn much more about front-end development while doing more artistic design projects on the side for friends and family. Outside of work I'm an explorer of new experiences, a horror aficionado, and a craft beer enthusiast among other things. :)",
    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "ajsora@gmail.com",
    "phone": "610-724-1491",
    "address":{
      "street":"906 Pine St.",
      "city":"Philadelphia",
      "state":"PA",
      "zip": "19107"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload":"alex_serret_resume.docx",
    "social":[
      {
        "name":"facebook",
        "url":"http://facebook.com/alexander.serret",
        "className":"fa fa-facebook"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/alexanderserret/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"http://instagram.com/ajsora",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"http://github.com/ajserret",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Skilled in HTML5 with its associated scripting languages and working with integrated copy, graphics, and video. Extensive experience with Adobe Creative Suite and After Effects.",
    "education":[
      {
        "school":"Drexel University – Philadelphia, PA",
        "degree":"Bachelor of Science in Design Arts",
        "graduated":"Class of 2008",
        "description":" At Drexel I learned the foundations of web development, user interaction design, graphic design, programming, modeling, animation, visual effects, and game design. My final project was an interactive site for the National Park System of New Jersey, featuring 3D rendered interactive map of park grounds complete with informational pop-ups, educational videos, and 360 views of park and building interiors. I also minored in Fine Arts with a concentration on photography and screen printing."
      }
    ],
    "work":[
      {
        "company":"Sizmek (Formerly PointRoll)",
        "title":"Creative Developer",
        "years":"May 2010 – Present",
        "description":"Within my first year at PointRoll I was promoted from the Asset Intake team to my current role after successfully establishing a process for reviewing and debugging rich media advertising units. As a Creative Developer I am responsible for producing web-based ads (web banners, polite banners, expandable advertisements, takeovers, etc.) using HTML, CSS, JavaScript, and formerly Flash. Another primary duty of mine is ensuring client guidelines are incorporated into interface designs and design elements. As part of my job I often participate in brainstorming sessions with extended creative teams to develop design ideas for interactive web pages and modules. My team focuses on automotive clients such as Ford, Chrysler, Nissan and Toyota, who require extremely quick turn-around and low QA issue rates."
      },
      {
        "company":"Iroko Pharmaceuticals",
        "title":"Lead Labeling Graphic Artist",
        "years":"July 2008 – May 2010",
        "description":"At Iroko I designed and edited packaging artwork and product labeling for international marketing while adhering to strict pharmaceutical regulations. I was also in charge of providing graphics support for all departments, including preparing visuals for presentations, taking product photographs and creating labeling mock-ups."
      }
    ],
    "skills":[
      {
        "name":"HTML5",
        "level":"80%"
      },
      {
        "name":"CSS",
        "level":"80%"
      },
      {
        "name":"Javascript",
        "level":"75%"
      },
      {
        "name":"JSON",
        "level":"60%"
      },
      {
        "name":"jQuery",
        "level":"50%"
      },
      {
        "name":"XML",
        "level":"70%"
      },
      {
        "name":"Photoshop",
        "level":"90%"
      },
      {
        "name":"Illustrator",
        "level":"80%"
      },
      {
        "name":"After Effects",
        "level":"70%"
      },{
        "name":"InDesign",
        "level":"60%"
      },{
        "name":"Media Encoder",
        "level":"70%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Mars Chocolate CVS Super Bowl January 2018",
        "category":"An example of an expandable ad I created.",
        "image":"mars.png",
        "url":"https://szmk.io/ta?Z2s0NW85"
      },
      {
        "title":"Pet360 Merial Nexgaurd 2017",
        "category":"Another example of an ad I built.",
        "image":"pet360.png",
        "url":"https://szmk.io/ta?Z2s0NW9h"
      },
      {
        "title":"Target Weekly 2016",
        "category":"An ad I built which dynamically pulls in products from a feed.",
        "image":"target.png",
        "url":"https://szmk.io/ta?Z2s0NXI4"
      },
      {
        "title":"Chrysler Dynamic Offers",
        "category":"The KBB site often runs our Chrysler ads for which I build the dyanmic offers.",
        "image":"chrysler.png",
        "url":"https://www.kbb.com/chrysler/pacifica/2019/"
      }
    ],
    "personals1":
      {
        "src": "images/portfolio/galaxy_logo.png",
        "thumbW": 2,
        "thumbH": 1,
        "caption": "A pharmaceutical logo I designed."
      },
      "personals2":
        {
          "src": "images/portfolio/trinity.jpg",
          "thumbW": 1,
          "thumbH": 1,
          "caption": "A tattoo I designed based on Celtic symbology."
        },
    "personals3":
      {
        "src": "images/portfolio/vendetta.jpg",
        "thumbW": 7,
        "thumbH": 8,
        "caption": "A logo I made for a softball team called the Vendetta."
      },
      "personals4":
        {
          "src": "images/portfolio/pnsh7.jpg",
          "thumbW": 5,
          "thumbH": 3,
          "caption": "Another logo for a softball team."
        },
        "personals5":
          {
            "src": "images/portfolio/3s_logo.png",
            "thumbW": 1,
            "thumbH": 1,
            "caption": "A logo I designed for a friends' ice cream shop."
          },
          "personals6":
            {
              "src": "images/portfolio/ws_logo.jpg",
              "thumbW": 1,
              "thumbH": 1,
              "caption": "A symbol I created for a friends' game project. It is meant to convey a futuristic airship wheel."
            },
            "personals7":
              {
                "src": "images/portfolio/mym.png",
                "thumbW": 1,
                "thumbH": 1,
                "caption": "A logo I designed for a friends' contracting company."
              },
              "personals8":
                {
                  "src": "images/portfolio/arrow.jpg",
                  "thumbW": 1,
                  "thumbH": 1,
                  "caption": "Another tattoo I designed based on Celtic symbology."
                },
                "personals9":
                  {
                    "src": "images/portfolio/gaots.jpg",
                    "thumbW": 10,
                    "thumbH": 7,
                    "caption": "Golden Apple of the Sun - A project I did with a friend for a science meets art competition."
                  }
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user":"Kareem Abdul Jabbar"
      },
      {
        "text":"That Tim Baker must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user":"Steve Wozniak... impersonator"
      }
    ]
  }
}
